app/Controllers/Course.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` = 3
---

        // Verify user exists in database
        $db = \Config\Database::connect();
        $userExists = $db->table('users')->where('id', $userId)->countAllResults();

SELECT *
FROM `users`
WHERE `role` = 'teacher'
AND `users`.`deleted_at` IS NULL
---
        $isAdmin = ($userRole === 'admin');
        if ($isAdmin) {
            $userModel = new \App\Models\UserModel();
            $teachers = $userModel->where('role', 'teacher')->findAll();