app/Controllers/Teacher.php

SELECT COUNT(*) AS `numrows`
FROM `assignments`
WHERE `created_by` = '2'
SELECT COUNT(*) AS `numrows`
FROM `assignment_submissions`
JOIN `assignments` ON `assignments`.`id` = `assignment_submissions`.`assignment_id`
WHERE `assignments`.`created_by` = '2'
AND `assignment_submissions`.`status` = 'submitted'
SELECT `assignment_submissions`.*, `assignments`.`title` as `assignment_title`, `assignments`.`course_id`, `courses`.`title` as `course_title`, `users`.`name` as `student_name`
FROM `assignment_submissions`
JOIN `assignments` ON `assignments`.`id` = `assignment_submissions`.`assignment_id`
JOIN `courses` ON `courses`.`id` = `assignments`.`course_id`
JOIN `users` ON `users`.`id` = `assignment_submissions`.`student_id`
WHERE `assignments`.`created_by` = '2'
ORDER BY `assignment_submissions`.`submitted_at` DESC
 LIMIT 5
---
    public function dashboard()
    {
        // Check if user is logged in
        if (!session()->get('logged_in')) {
            session()->setFlashdata('error', 'You must be logged in to access the dashboard.');
            return redirect()->to('/login');
        }

        // Check if user is a teacher
        $userRole = strtolower(session('role') ?? '');
        if ($userRole !== 'teacher') {
            session()->setFlashdata('error', 'Access denied. Teachers only.');
            return redirect()->to('/dashboard');
        }

        // Get teacher's assignments count
        $teacherId = session('userID');
        $assignmentsCount = $this->assignmentModel->where('created_by', $teacherId)->countAllResults();

        // Get pending submissions count
        $pendingSubmissions = $this->submissionModel->select('assignment_submissions.*')
            ->join('assignments', 'assignments.id = assignment_submissions.assignment_id')
            ->where('assignments.created_by', $teacherId)
            ->where('assignment_submissions.status', 'submitted')
            ->countAllResults();

        // Get recent submissions (last 5)
        $recentSubmissions = $this->submissionModel->select('assignment_submissions.*, assignments.title as assignment_title, assignments.course_id, courses.title as course_title, users.name as student_name')
            ->join('assignments', 'assignments.id = assignment_submissions.assignment_id')
            ->join('courses', 'courses.id = assignments.course_id')
            ->join('users', 'users.id = assignment_submissions.student_id')
            ->where('assignments.created_by', $teacherId)
            ->orderBy('assignment_submissions.submitted_at', 'DESC')
            ->limit(5)
            ->findAll();