app/Models/NotificationModel.php

    public function getNotificationsForUser($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
 LIMIT 5