app/Models/QuizModel.php

    public function getQuizzesByTeacher($teacherId)
    {
        return $this->select('quizzes.*, courses.title as course_title')
                    ->join('courses', 'courses.id = quizzes.course_id')
                    ->where('courses.instructor_id', $teacherId)
                    ->orderBy('quizzes.created_at', 'DESC')
                    ->findAll();
---
SELECT `quizzes`.*, `courses`.`title` as `course_title`
FROM `quizzes`
JOIN `courses` ON `courses`.`id` = `quizzes`.`course_id`
WHERE `courses`.`instructor_id` = '2'
ORDER BY `quizzes`.`created_at` DESC